<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [200]:
import pandas as pd
import psycopg2

In [201]:
# снятие ограничения на вывод количества строк и столбцов
pd.set_option('display.max_rows', 200)
#pd.set_option('display.max_columns', 500)
#pd.set_option('display.width', 1000)

In [202]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [203]:
connection = psycopg2.connect(
    dbname='project_sql',
    user='skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port=5432
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [204]:
# текст запроса
query_3_1 = f'''SELECT /*  оператор,  содержащий выводимые параметры */
                     COUNT (*)
                FROM /* оператор, включающий таблицы, в которых находятся параметры для вывода */
                     vacancies v
        '''

In [205]:
# результат запроса
result_3_1 = pd.read_sql_query(query_3_1, connection) # оператор Python перевода запроса в DataFrame таблицу
display (result_3_1)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1322040154.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_3_1 = pd.read_sql_query(query_3_1, connection) # оператор Python перевода запроса в DataFrame таблицу

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [206]:
# текст запроса
query_3_2 = f'''SELECT 
                    COUNT (*)
                FROM 
                    employers em
        '''

In [207]:
# результат запроса
result_3_2 = pd.read_sql_query(query_3_2, connection)
display (result_3_2)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\3989190920.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_3_2 = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [208]:
# текст запроса
query_3_3 = f'''SELECT 
                    COUNT (*)
                FROM 
                    areas ar
        '''

In [209]:
# результат запроса
result_3_3 = pd.read_sql_query(query_3_3, connection)
display (result_3_3)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2586691919.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_3_3 = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитайте с помощью запроса количество сфер деятельности в базе (таблица industries).

In [210]:
# текст запроса
query_3_4 = f'''SELECT 
                    COUNT (*)
                FROM 
                    industries ind
        '''

In [211]:
# результат запроса
result_3_4 = pd.read_sql_query(query_3_4, connection)
display (result_3_4)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1755248566.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_3_4 = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [212]:
# выводы по предварительному анализу данных
# 1.   Исходя из представленных выше нескольких общих запросов можно представить себе широкий охват базы hh, содержащей около 50 тысяч вакансий.
#    Возможно получить некоторые средние величины, о том, что в среднем, например, на каждую отрасль приходится ~167 вакансий, а каждая фирма заявляет в
#    среднем о 2-х свободных рабочих местах. Ничего более подробного, на первый взгляд, по этим данным выявить не получится.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [213]:
# текст запроса
n=30
query_4_1=f'''SELECT
                   ar.name "Название города",
                   COUNT(*) "Количество вакансий"
              FROM vacancies v
              JOIN areas ar ON v.area_id = ar.id /* присоединение таблицы areas к vacancies*/
              GROUP BY ar.name /* группировка информации по названию городов */
              ORDER BY "Количество вакансий" desc /* размещение вакансий по убыванию */
              LIMIT {n} /* ограничение на вывад количества строк */
          '''

In [214]:
# результат запроса
result_4_1 = pd.read_sql_query(query_4_1, connection)
display (result_4_1)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\3618724040.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_1 = pd.read_sql_query(query_4_1, connection)

    Название города  Количество вакансий
0            Москва                 5333
1   Санкт-Петербург                 2851
2             Минск                 2112
3       Новосибирск                 2006
4            Алматы                 1892
5      Екатеринбург                 1698
6   Нижний Новгород                 1670
7            Казань                 1415
8         Краснодар                 1301
9            Самара                 1144
10   Ростов-на-Дону                 1131
11          Воронеж                 1063
12          Ташкент                  851
13       Красноярск                  847
14       Нур-Султан                  840
15        Челябинск                  786
16            Пермь                  771
17              Уфа                  767
18            Томск                  692
19             Омск                  617
20          Саратов                  579
21           Тюмень                  547
22      Владивосток                  539
23          Тбилиси                  474
24           Ижевск                  466
25        Волгоград                  456
26          Иркутск                  451
27        Ярославль                  391
28          Барнаул                  374
29           Рязань                  346

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [215]:
# текст запроса
query_4_2 = f'''SELECT 
                   COUNT(*) "Количество вакансий"
                FROM vacancies
                /* ниже условае, в соответствии с которым будет выводиться информация */
                WHERE (salary_from is not NULL) or (salary_to is not NULL) 
          '''

In [216]:
# результат запроса
result_4_2 = pd.read_sql_query(query_4_2, connection)
display (result_4_2)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\682276766.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_2 = pd.read_sql_query(query_4_2, connection)

   Количество вакансий
0                24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [217]:
# текст запроса
query_4_3 = f'''SELECT 
                   ROUND(AVG(salary_from),0) as min_solary,
                   ROUND(AVG(salary_to),0) as max_solary
                FROM vacancies
            '''

In [218]:
# результат запроса
result_4_3 = pd.read_sql_query(query_4_3, connection)
display (result_4_3)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2363652455.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_3 = pd.read_sql_query(query_4_3, connection)

   min_solary  max_solary
0     71065.0    110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [219]:
# текст запроса
query_4_4 = f'''SELECT 
                   v.schedule,
                   v.employment,
                   COUNT (v.id)
                FROM vacancies v
                GROUP BY v.schedule,v.employment
                ORDER BY COUNT (v.id) desc
            '''

In [220]:
# результат запроса
result_4_4 = pd.read_sql_query(query_4_4, connection)
display (result_4_4)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\3082978449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_4 = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [221]:
# текст запроса
query_4_5 = f'''SELECT 
                   v.experience,
                   COUNT (v.id)
                FROM vacancies v
                GROUP BY v.experience
                ORDER BY COUNT (v.id)
            '''

In [222]:
# результат запроса
result_4_5 = pd.read_sql_query(query_4_5, connection)
display (result_4_5)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\3035781761.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_5 = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [223]:
# выводы по детальному анализу вакансий
# 1. На основании result_4_1 можно заключить, что только 769 регионов имеют количество вакансий, отличных от 0, что составляет 56%
#    от всего представленного списка areas. Здесь надо отметить, что hh имеет дело в основном с высококвалифицированными кадрами. Это означает,
#    что около половины регионов из таблицы areas (очень маленькие города стран СНГ) не имеет спроса на квалифицированный труд или не пользуются hh.
#
# 2. Удивляет, что в более половине вакансий (~52%) работодатели никак не заявляют о зарплате (result_4_2). На то могут быть различные причины,
#    но в целом, это говорит о слабой развитости рынка труда в каких то отраслях или районах ( надо разобраться в каких?).
#    Претенденты не понимают, на какую зарплату они могут рассчитывать.
#
# 3. Порадовала вилка зарплаты, так как средняя минимальная больше 70 тысяч, и это по СНГ, значит в России должна быть еще больше!
#
# 4. Из запроса result_4_4 видно, что беззаговорочно лидирует очная работа по полной занятости. Однако, дисстанционная работа + полная занятость
#    прочно на 2-м месте и составляет ~22% от очной. Интересно, это предел, или всеже этот процент будет возрастать? Остальные сочетания графика
#    и занятости далеко внизу.
#
# 5. Что касается result_4_5, то количество вакансий без опыта в сумме с вакансиями с минимальным опытом от 1 до 3-х лет составляет ~68%.
#    Это означает, что рынок труда на большом подъеме и вбирает в себя максимум менее квалифицированных кадров.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [224]:
# текст запроса
query_5_1=f'''SELECT 
                  em.name "Имя работодателя",
                  COUNT(*) "Количество вакансий"
            FROM vacancies v
            JOIN employers em on v.employer_id = em.id
            GROUP BY em.name
            ORDER BY "Количество вакансий" DESC
            LIMIT 15
          '''

In [225]:
# результат запроса
result_5_1 = pd.read_sql_query(query_5_1, connection)
display (result_5_1)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2460377660.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_1 = pd.read_sql_query(query_5_1, connection)

         Имя работодателя  Количество вакансий
0                  Яндекс                 1933
1              Ростелеком                  491
2                Тинькофф                  444
3                    СБЕР                  428
4           Газпром нефть                  331
5             ИК СИБИНТЕК                  327
6                     МТС                  292
7                 DataArt                  247
8   Совкомбанк Технологии                  204
9              Первый Бит                  176
10                   Ozon                  175
11                    IBS                  175
12               Andersen                  155
13                 Тензор                  155
14             Спецремонт                  151

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [226]:
# текст запроса
query_5_2 = f'''SELECT 
                    a.name,
                    COUNT(distinct e.id) cnt_emp,
                    COUNT(distinct v.id) cnt_vac
                FROM areas a
/* операторы левого присоединения к таблице areas таблиц employers и vacancies */
                LEFT JOIN employers e ON a.id = e.area
                LEFT JOIN vacancies v ON v.area_id = a.id
/*WHERE v.id is null   если открыть этот фильтр, то будет условие отсутствия вакансий*/
GROUP BY a.id
ORDER BY cnt_emp DESC
LIMIT 10
'''

In [227]:
# результат запроса
result_5_2 = pd.read_sql_query(query_5_2, connection)
display (result_5_2)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\856196622.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_2 = pd.read_sql_query(query_5_2, connection)

              name  cnt_emp  cnt_vac
0           Москва     5864     5333
1  Санкт-Петербург     2217     2851
2            Минск     1115     2112
3           Алматы      721     1892
4     Екатеринбург      609     1698
5      Новосибирск      573     2006
6           Казань      480     1415
7  Нижний Новгород      426     1670
8           Россия      410        0
9        Краснодар      409     1301

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [228]:
# текст запроса
query_5_3 = f'''SELECT 
                   em.name employer,
                   COUNT(distinct v.area_id) areas
                FROM employers em
                LEFT JOIN vacancies v on em.id = v.employer_id
                GROUP BY em.name
                ORDER BY 2 DESC
                LIMIT 10
'''

In [229]:
# результат запроса
result_5_3 = pd.read_sql_query(query_5_3, connection)
display (result_5_3)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2579951715.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_3 = pd.read_sql_query(query_5_3, connection)

                     employer  areas
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
5                  Совкомбанк     63
6                         МТС     55
7  ЭФКО, Управляющая компания     49
8                Почта России     48
9                        КРОН     48

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [230]:
# текст запроса
query_5_4 = f'''SELECT
                  COUNT (distinct em.id)
                FROM employers em
                LEFT JOIN employers_industries ei ON em.id = ei.employer_id
                WHERE ei.employer_id is NULL
'''

In [231]:
# результат запроса
result_5_4 = pd.read_sql_query(query_5_4, connection)
display (result_5_4)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\29886723.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_4 = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [232]:
# текст запроса
query_5_5 = f'''SELECT
                  em.name,
                  COUNT(distinct ei.industry_id)
                FROM employers em
                LEFT JOIN employers_industries ei ON em.id = ei.employer_id
                GROUP BY em.name
/* HAVING - фильтр, позволяющий взять из уже выбранных параметров нужные(4 сферы деятельносьти) */
                HAVING COUNT(distinct ei.industry_id) = 4 
                ORDER BY COUNT(distinct ei.industry_id) DESC
'''

In [233]:
# результат запроса
result_5_5 = pd.read_sql_query(query_5_5, connection)
display (result_5_5)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\574944642.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_5 = pd.read_sql_query(query_5_5, connection)

                 name  count
0        101 Интернет      4
1            21vek.by      4
2                2ГИС      4
3                  2К      4
4         4 пикселя +      4
...               ...    ...
1127            ЮРИОН      4
1128  ЮТИП Технологии      4
1129           ЯКласс      4
1130            ЯрНео      4
1131    Яшин&Партнёры      4

[1132 rows x 2 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [234]:
# текст запроса
query_5_6 = f''' SELECT 
                     COUNT(em.name)
                 FROM employers em
                 JOIN employers_industries ei ON ei.employer_id = em.id
                 JOIN industries i ON ei.industry_id = i.id
                 GROUP BY  i.name
                 HAVING i.name LIKE 'Разработка программного обеспечения'
'''

In [235]:
# результат запроса
result_5_6 = pd.read_sql_query(query_5_6, connection)
display (result_5_6)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1575232847.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_6 = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [236]:
# код для получения списка городов-милионников
#
import requests
from bs4 import BeautifulSoup
#
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response = requests.get(url)
#
page = BeautifulSoup(response.text,'html.parser')
data = []
HTML_data = page.find_all("table")[0].find_all("tr")[1:]
for element in HTML_data:
    sub_data = []
    for i,k in enumerate(element):
        try:
            if i==1:
                sub_data.append(k.get_text())
        except:
            continue
    data.append(sub_data)
data_result = []
for elem in data:
    data_result.extend(elem)
data_result = tuple(data_result)

In [237]:
# текст запроса
query_5_7 = f'''(SELECT
                    ar.name,
                    COUNT(v.id) as cnt
                FROM vacancies v
                LEFT JOIN employers em ON v.employer_id = em.id
                LEFT JOIN areas ar on ar.id = v.area_id
                WHERE ar.name in {data_result}
                      and em.name = 'Яндекс'
                      and v.id is not null
                GROUP BY 1
                ORDER BY 2)
                
                UNION ALL
/* запрос для выведения total вакансий */
                SELECT 
                    'total',
                    SUM(cnt)
                FROM
/* повторение части верхнего запроса */
                (SELECT
                    ar.name,
                    COUNT(v.id) as cnt
                FROM vacancies v
                LEFT JOIN employers em on v.employer_id = em.id
                LEFT JOIN areas ar on ar.id = v.area_id
                WHERE ar.name in {data_result}
                      and em.name = 'Яндекс'
                      and v.id is not null
                GROUP BY 1
                ORDER BY 2) as tt /* необходимо было присвоить формальный алиас */
            '''

In [238]:
# результат запроса
result_5_7 = pd.read_sql_query(query_5_7, connection)
display(result_5_7)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1654204566.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_7 = pd.read_sql_query(query_5_7, connection)

               name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7               Уфа   26.0
8            Самара   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            total  485.0

***

In [239]:
# выводы по анализу работодателей
# 1.  Из result_5_1 можно выявить четыре наиболее быстро развивающихся компании (Яндекс, Ростелеком, Тинькофф, Сбер) это видно по наибольшему
#     количкству вакансий, которые предлагают эти фирмы.
#
# 2.  Исходя из result_5_2 в Москве и Санкт-Петербурге приходится ~ по одной вакансии на работодателя, что говорит ( в
#     среднем) о существенном насыщении рынка квалифицированных специалистов в наших двух мегополисах. В остальных относительно крупных городах
#     первой сотни ситуация другая, вакансий заметно больше чем количество работодателей. Это говорит также за активное развитие рынка труда в провинции,
#     что мы  можем сейчас наблюдать, например, в Московской области. В разделе вакансий, относящихся к названию стран ( например Россия)
#     стоят подозрительные нули - это потому, что их не так-то просто подсчитать, так как принадлежность городов к странам в таблице не представлена.
#
# 3.  (result_5_3) Два работадателя из перечисленных четырех в п. 1, а именно, Яндекс и Ростелеком, лидируют еще и по распрастранению вакансий
#     среди регионов,т.о. эти компании растут еще и вширь буквально. На примере Яндекса мы можем наблюдать это в жизни 
#     ( Яндекс маркет повсюду, яндекс такси).
#
# 4.  (result_5_4, добавочный запрос result_add_1) Количество предприятий, где не указана сфера деятельности 8419, значит количество предприятий
#     со сферами деятельности 23501-8419 = 15082. Работадатели по убыванию количества сфер деятельности представлены в таблице result_add_1.
#     На вид в этой последовательности работодателей не просмотривается закономерностей. Количество ваконсий в этой последовательности у предпиятий
#     расположены рандомно.
#
#  5. (result_5_6, result_add_2) Среди 3553-х компаний с разработкой программного обеспечения выведено 11 первых, где количество вакансий
#      больше 100.  Беззаговорочный лидер Тиникофф (444 вакансии), из известных на 11 месте Мегафон (104). Всего же на просторах СНГ и некоторых
#      мировых рускоязычных сегментах 12500 программистских вакансий единовременно ( только лишь на сайте hh). Отдельно можно попытаться оценить
#      какую же часть вакансий представляет hh от действительно реально существующих?
#
#  6.  (result_5_7) Самый сложный запрос демонстрирует как сильно распространена компания Яндекс по городам-миллионникам.Всего 485 вакансий
#      Яндекса в миллионниках. Это также говорит о стремительном развитии Яндекса по России, что хорошо видно в реальной жизни.
#     
#

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [240]:
# текст запроса
query_6_1 = f'''SELECT 
                    v.id
                FROM public.vacancies v
                WHERE lower(v.name) LIKE ('%data%') or lower(v.name) LIKE ('%данн%')
                GROUP BY v.id'''

In [241]:
# результат запроса
result_6_1 = pd.read_sql_query(query_6_1, connection)
display(result_6_1)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\770274529.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_1 = pd.read_sql_query(query_6_1, connection)

            id
0     33368305
1     38591002
2     38792530
3     39345694
4     39733919
...        ...
1766  66192509
1767  66193657
1768  66195062
1769  66195063
1770  66195157

[1771 rows x 1 columns]

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [242]:
# текст запроса
query_6_2 = f'''SELECT 
                    name
               FROM vacancies
/*  фильтр, обозначающий специалистов DS--------------------- */
               WHERE ((name ILIKE '%data scientist%')
                    OR(name ILIKE '%data science%')
                    OR(name ILIKE '%исследователь данных%')
                    OR(name ILIKE '%machine learning%')
                    OR(name ILIKE '%машинн%обучен%')
                    OR(name ILIKE '%ML%' AND name NOT ILIKE '%HTML%'))
/*------фильтр, обозначающий junior ------------*/
                    AND ((name ILIKE '%junior%'
                        OR experience = 'Нет опыта'
                        OR employment = 'Стажировка'))
               '''

In [243]:
# результат запроса
result_6_2 = pd.read_sql_query(query_6_2, connection)
display(result_6_2)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1895777525.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_2 = pd.read_sql_query(query_6_2, connection)

                                                 name
0                             Junior+ CV/ML developer
1                            Data Scientist (Junior+)
2                      Junior Data Scientist (Стажер)
3      Математик, Junior/Middle/Senior Data Scientist
4                               Junior Data Scientist
5   Data Scientist/Machine Learning Engineer (Deve...
6                             Data Scientist (Junior)
7                        Intern/Junior Data Scientist
8                          Junior Data Scientist (VK)
9                        Junior/Middle Data Scientist
10          Data Scientist (Computer Vision) - Junior
11  Исследователь в области машинного обучения и м...
12                             Data Scientist, Junior
13  Junior Data Scientist Управления модельных рис...
14  Математик-аналитик (data scientist / data anal...
15                    Data Scientist (junior+/middle)
16                              Junior Data Scientist
17                 Research Engineer / Data Scientist
18  Стажер направления Машинное обучение и анализ ...
19  Стажёр Data Scientist / Группа сервисов Антифр...
20                              Junior Data Scientist
21          Senior Research Engineer / Data Scientist
22                              Ведущий AI/ML инженер
23        Data scientist (Junior/Middle) в консалтинг
24  Junior Data Scientist (математик-аналитик) уда...
25             Junior Data Scientist (Promo Forecast)
26  Data Scientist/Machine Learning Engineer (Deve...
27                              Data Scientist в Сбер
28  Data Scientist/Machine Learning Engineer (Deve...
29  Junior Data Scientist (Валидация скоринговых м...
30  Junior Data Scientist (Валидация скоринговых м...
31  Junior Data Scientist (Валидация скоринговых м...
32  Junior Data Scientist (Валидация скоринговых м...
33  Junior Data Scientist (Валидация скоринговых м...
34  Junior Data Scientist (Валидация скоринговых м...
35  Junior Data Scientist (Валидация скоринговых м...
36  Junior Data Scientist (Валидация скоринговых м...
37  Junior Data Scientist (Валидация скоринговых м...
38            Риск - Аналитик (Junior Data scientist)
39  Программист Python/ Data Scientist (junior / m...
40       Риск-аналитик (ML Engineer / Data Scientist)
41            Data Scientist/ML engineer (Python/C++)
42       Junior Data scientist/ Младший риск-аналитик
43                         Senior Data Scientist (AI)
44             Junior Data Scientist for NLP (Python)
45          Junior Research Engineer / Data Scientist
46                              Ведущий AI/ML инженер
47                                     Data Scientist
48              Python developer / Junior ML engineer
49                             Data Scientist, Junior
50          Data Scientist (Computer Vision) / Junior

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [244]:
# текст запроса
query_6_3 = f'''SELECT 
                     COUNT(id) 
                FROM public.vacancies
                WHERE (name ILIKE '%data scientist%' 
                      OR name ILIKE '%data science%' 
                      OR name ILIKE '%исследователь данных%' 
                      OR (name ILIKE '%ml%' AND lower(name) NOT LIKE '%html%')
                      OR name ILIKE '%machine learning%' 
                      OR name ILIKE '%машинн%обучен%')
                      AND key_skills IS NOT NULL 
                      AND (key_skills ILIKE '%sql%' 
                      OR  key_skills ILIKE '%postgres%')
'''

In [245]:
# результат запроса
result_6_3 = pd.read_sql_query(query_6_3, connection)
display(result_6_3)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2499915475.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_3 = pd.read_sql_query(query_6_3, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [246]:
# текст запроса
query_6_4 = f'''SELECT 
                    COUNT(id) 
                FROM public.vacancies
                WHERE (name ILIKE '%data scientist%' 
                     OR name ILIKE '%data science%' 
                     OR name ILIKE '%исследователь данных%' 
                     OR (name ILIKE '%ml%' AND lower(name) NOT LIKE '%html%')
                     OR name ILIKE '%machine learning%' 
                     OR name ILIKE '%машинн%обучен%') 
                     AND key_skills IS NOT NULL 
                     AND key_skills ILIKE '%python%'
'''

In [247]:
# результат запроса
result_6_4 = pd.read_sql_query(query_6_4, connection)
display(result_6_4)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2287851152.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_4 = pd.read_sql_query(query_6_4, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [248]:
# текст запроса
query_6_5 = f'''SELECT 
                    ROUND(avg(length(v.key_skills) - length(replace(v.key_skills, CHR(9), '')) + 1), 2)
                FROM vacancies v
                WHERE ( (v.name ILIKE '%data scientist%') 
                   OR (lower(v.name) ILIKE '%data science%') 
                   OR (v.name ILIKE '%исследователь данных%') 
                   OR (v.name LIKE '%ML%' AND (v.name NOT ILIKE '%HTML%'))
                   OR (v.name ILIKE '%machine learning%') 
                   OR (v.name ILIKE '%машинн%обучен%') 
                   AND (key_skills IS NOT NULL ))
          '''

In [249]:
# результат запроса
result_6_5 = pd.read_sql_query(query_6_5, connection)
display(result_6_5)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\913155824.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_5 = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [250]:
# текст запроса
query_6_6 = f'''SELECT 
                     DISTINCT experience,
                     ROUND(AVG(coalesce((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0)
               FROM vacancies v   
               WHERE ( (v.name ILIKE '%data scientist%') 
                  OR (lower(v.name) ILIKE '%data science%') 
                  OR (v.name ILIKE '%исследователь данных%') 
                  OR (v.name LIKE '%ML%' AND (v.name NOT ILIKE '%HTML%'))
                  OR (v.name ILIKE '%machine learning%') 
                  OR (v.name ILIKE '%машинн%обучен%')
                  and (v.salary_from is not null
                  OR v.salary_to is not null))
               GROUP BY v.experience
               ORDER BY 2 DESC
'''

In [251]:
# результат запроса
result_6_6 = pd.read_sql_query(query_6_6, connection)
display(result_6_6)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1410580455.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_6 = pd.read_sql_query(query_6_6, connection)

           experience     round
0         Более 6 лет       NaN
1       От 3 до 6 лет  243115.0
2  От 1 года до 3 лет  139675.0
3           Нет опыта   74643.0

***

In [252]:
# выводы по предметному анализу
# 1. Всего 536 (result_add_3) вакансий на работы, связанные с DS. Для начинающих DS в hh значится всего 51 вакансия (result_6_2)
#    это откровенно мало. Выходит, что рынок требует data scientists более высокой квалификации.Это существенно противоречит общей тенденции,
#    о которой говорилось выше, о том, что развивающийся рынок труда запрашивает большое количество специалистоа с малым опытом. Вероятно DS это специфическая
#    область и в ней требуется опыт. Это еще подтверждается тем, что среднее количество ключевых навыков data scientist составляет от 6 до 7 (result_6_5).
#    Это говорит о том, что соискатель должен быть весьма подкован.
# 2. (result_6_6) Вычисленная средняя зарплата junior ~ 74 т.р. примерно соответствует средней минимальной зарплате (~ 71 т.р.) 
#     по всем отрослям (result_4_3), что опять же подтверждает невысокую заинтересованность работодателей в начинающих data scientists.
#     Однако, даже небольшой опыт 1-3 года выводит на ~ 140 т.р., что заметно больше средней максимальной зарплаты в ~110,5 т.р. (result_4_3).
#     Опыт 3-6 лет соответствует 243 т.р., что более чем в два раза превышает среднюю максимальную по всем отраслям.
# 3.  В result_add_4 и result_add_5 приведены списки работодателей по количеству вакансий (в порядке убывания) DS и DS junior соответственно.
#     В таблицах почти нет пересечений по предприятиям, однако, банк ВТБ является самым лояльным по отношению к junior, так как потребность
#     в "молодых специалистах" там сравнима с потребностью в более опытных data scientists.

# Общий вывод по проекту

In [253]:
# подведем итог исследования, обобщите выводы
#
# 1. В hh представлен общирный список вакансий и работодателей по большому количеству регионов СНГ и широкому кругу специальностей.
# 2. Мы наблюдаем слабо развитый рынок квалифицированных кадров в провинции, так как около половины регионов не имеют ни одного объявления о вакансиях.
#    На слабую развитость рынка труда указывает также и то, что половина работадателей не дают информацию о зарплате.
# 3. В тоже время, некоторые факторы указжывают на то, что процесс развития рынка происходит. Об этом говорят, например, большая
#    потребность в молодых специалистах и довольно значитальная средняя минимальная зарплата.
# 4. Заметной тенденциеей является значительная доля дисстанционных вакансий. 
# 5. Четыре наиболее быстро развивающихся компании (Яндекс, Ростелеком, Тинькофф, Сбер), скорее всего указывают на быстро развивающиеся
#    отрасли: IT технологии, связь и банковское дело.
# 6. В IT отрасли, связанной с data science весьма невысокий спрос приходится на junior (~ 10% вакансий), на специалистов DS накладыва-
#    ются значительные требований (более 6 ключевых навыков). Банк ВТБ заявляет о наибольшем по базе наборе junior (10 вакансий).
# 7. Зарплата специалистов DS с опытом 1-6 лет  находится в пределах 140-243 т.р., что существенно больше средней максимальной по всем отраслям.
#    
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
# п р о д о л ж е н и я  и с с л е д о в а н и й
# -  исследовать как распределены вакансии и дисстанционные вакансии по отраслям.
# -  распределение зарплаты по отраслям.
# -  распределение работодателей по количеству дисстанционных вакансий в DS, где требуются навыки Python и SQL (актуально).
# -  исследовать количество вакансий и распрострпанение по регионам маркетплэйсов (Wildberries, Ozon, Yandex).
# -  исследовать количество вакансий в 3-х быстро развивающиеся отраслях: IT технологиях, связи и банковском деле.
#

In [254]:
# Д О П О Л Н И Т Е Л Ь Н Ы Е  З А П Р О С Ы
#
# работодатели по убыванию количества сфер деятельности и количеству вакансий
# текст запроса
query_add_1 = f'''SELECT
                      em.name as "работодатель",
                      COUNT(distinct ei.industry_id) as "кол_сфер_деятельности",
                      COUNT(v.id) as "количество_вакансий"
                  FROM employers em
                  LEFT JOIN employers_industries ei ON em.id = ei.employer_id
                  LEFT JOIN vacancies v ON ei.employer_id = v.employer_id
                  GROUP BY em.name
                  ORDER BY count(distinct ei.industry_id) DESC
                  LIMIT 20
'''
result_add_1 = pd.read_sql_query(query_add_1, connection)
display(result_add_1)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1926736988.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_add_1 = pd.read_sql_query(query_add_1, connection)

        работодатель  кол_сфер_деятельности  количество_вакансий
0             Модуль                     16                    8
1            Энергия                     10                    5
2              Прайд                     10                    6
3                СБК                      9                    0
4              Альфа                      9                   14
5          ТехноПром                      8                    6
6   Бизнес-Ассистанс                      8                   41
7           Прогресс                      8                    5
8             Фрегат                      8                    3
9             АТЛАНТ                      8                   27
10         Континент                      7                   10
11        Инициатива                      7                    2
12             Гамма                      7                   10
13            Махаон                      7                   13
14             Сфера                      7                    5
15           Альтаир                      7                    7
16       Продвижение                      7                   35
17         Аквамарин                      7                   17
18           Mercury                      7                    3
19  Новые технологии                      7                    8

In [255]:
# работодатели  с 'разработкой программного обемпечения' в порядке убывания количества вакансий
query_add_2 = f''' (SELECT 
                          e.name as "работодатели",
                          COUNT(v.id) as "вакансии"       
                    FROM EMPLOYERS e
                    JOIN vacancies v on e.id=v.employer_id
                    JOIN EMPLOYERS_INDUSTRIES ei ON ei.employer_id = e.id
                    JOIN INDUSTRIES i ON ei.industry_id = i.id
                    GROUP BY e.name,i.name
                    HAVING i.name LIKE 'Разработка программного обеспечения'
                    ORDER BY "вакансии" DESC
                    LIMIT 11)
                    
                    UNION ALL
                    
                    SELECT 
                        'total',
                        SUM("вакансии") /* считает сумму всех вакансий, не только тех, что выведены непосредственно */
                    FROM 
                      (SELECT 
                          em.name as "работодатели",
                          COUNT(v.id) as "вакансии"       
                    FROM employers em
                    JOIN vacancies v on em.id=v.employer_id
                    JOIN EMPLOYERS_INDUSTRIES ei ON ei.employer_id = em.id
                    JOIN INDUSTRIES ind ON ei.industry_id = ind.id
                    GROUP BY em.name,ind.name
                    HAVING ind.name LIKE 'Разработка программного обеспечения'
                    ORDER BY "вакансии" DESC) as tt
'''
result_add_2 = pd.read_sql_query(query_add_2, connection)
display(result_add_2)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\3419784628.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_add_2 = pd.read_sql_query(query_add_2, connection)

               работодатели  вакансии
0                  Тинькофф     444.0
1                   DataArt     247.0
2     Совкомбанк Технологии     204.0
3                       IBS     175.0
4                    Тензор     155.0
5                  Andersen     155.0
6                        VK     150.0
7                     ЛАНИТ     117.0
8   Лига Цифровой Экономики     110.0
9                  Softline     108.0
10                  МегаФон     104.0
11                    total   12499.0

In [256]:
# общее количество вакансий направления DS
#
query_add_3 = f'''SELECT 
                    COUNT(v.id) as " общее кол. вакансий DS "
               FROM vacancies v
               WHERE ((name ILIKE '%data scientist%')
                    OR(name ILIKE '%data science%')
                    OR(name ILIKE '%исследователь данных%')
                    OR(name ILIKE '%machine learning%')
                    OR(name ILIKE '%машинн%обучен%')
                    OR(name ILIKE '%ML%' AND name NOT ILIKE '%HTML%'))
'''
result_add_3 = pd.read_sql_query(query_add_3, connection)
display(result_add_3)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1001471972.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_add_3 = pd.read_sql_query(query_add_3, connection)

   общее кол. вакансий DS
0                      536

In [257]:
# распределение по компаниям всех hh DS вакансий
query_add_4 = f'''SELECT 
                    em.name as "работодатели",
                    COUNT(v.name) as "кол. всех DS вакансий"
                  FROM employers em
                  LEFT JOIN vacancies v on em.id = v.employer_id
                  WHERE ((v.name ILIKE '%data scientist%')
                       OR(v.name ILIKE '%data science%')
                       OR(v.name ILIKE '%исследователь данных%')
                       OR(v.name ILIKE '%machine learning%')
                       OR(v.name ILIKE '%машинн%обучен%')
                       OR(v.name ILIKE '%ML%' AND v.name NOT ILIKE '%HTML%'))
                  GROUP BY em.name
                  ORDER BY "кол. всех DS вакансий" DESC
                  LIMIT 10
'''
result_add_4 = pd.read_sql_query(query_add_4, connection)
display(result_add_4)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\2830593603.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_add_4 = pd.read_sql_query(query_add_4, connection)

            работодатели  кол. всех DS вакансий
0                   СБЕР                     39
1        Bell Integrator                     25
2         Банк ВТБ (ПАО)                     18
3                     VK                     15
4  Positive Technologies                     11
5                 Яндекс                      9
6         EvenBet Gaming                      9
7                МегаФон                      8
8               Andersen                      7
9     Бэнкс Софт Системс                      6

In [258]:
# распределение по компаниям всех hh junior DS вакансий
query_add_5 = f'''SELECT 
                    em.name as "работодатели",
                    COUNT(v.name) as "кол. DS junior вакансий"
                  FROM employers em
                  LEFT JOIN vacancies v on em.id = v.employer_id
                  WHERE ((v.name ILIKE '%data scientist%')
                       OR(v.name ILIKE '%data science%')
                       OR(v.name ILIKE '%исследователь данных%')
                       OR(v.name ILIKE '%machine learning%')
                       OR(v.name ILIKE '%машинн%обучен%')
                       OR(v.name ILIKE '%ML%' AND v.name NOT ILIKE '%HTML%'))
                  AND ((v.name ILIKE '%junior%'
                           OR v.experience = 'Нет опыта'
                           OR v.employment = 'Стажировка'))
                  GROUP BY em.name
                  ORDER BY "кол. DS junior вакансий" DESC
                  LIMIT 10
'''
result_add_5 = pd.read_sql_query(query_add_5, connection)
display(result_add_5)

C:\Users\Asus\AppData\Local\Temp\ipykernel_5672\1358241531.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_add_5 = pd.read_sql_query(query_add_5, connection)

                                       работодатели  кол. DS junior вакансий
0                                    Банк ВТБ (ПАО)                       10
1                                            Comexp                        3
2  The Skolkovo Institute of Science and Technology                        3
3                                     SteadyControl                        2
4     СтарЛайн, Научно-производственное объединение                        2
5                                            Диплей                        2
6                                            Seldon                        1
7                                 DNS Головной офис                        1
8                                                VK                        1
9                                          Pay P.S.                        1